# Pandas Basics I

We will start with the practice of basic operations in Pandas. It is very important to get familiar with this stuff because we will be using it again and again throughout this course.

We will cover an introduction to Pandas, specifically:

    Attributes of Pandas objects
    Counting values in Series
    Altering labels
    .dt and .str accessors
    Sorting

One of the great things about the frequently used Python packages is that their documentation is really good. We can usually easily google anything we want to do in Pandas. We will also be working intensively with the official documentation throughout this course.

We can continue in the notebook from the previous activity. If you decide to create a new one, don't forget to import the packages.

## Attributes of Pandas objects

Pandas objects have a number of attributes enabling us to access metadata:

    Shape: gives the axis dimensions of the object, consistent with ndarray

    Axis labels:
        Series: index (only axis)
        DataFrame: index (rows) and columns

In [36]:
import numpy as np
import pandas as pd

In [37]:
df = pd.DataFrame(np.random.randn(8, 3), columns=['A', 'B', 'C'])

In [38]:
df.columns = [x.lower() for x in df.columns]

In [39]:
df

          a         b         c
0 -1.290241  0.950648  0.274713
1 -0.354178  0.192359 -0.358170
2  0.731107  0.335193 -1.179439
3  0.162143  1.656856 -0.826419
4 -0.767878 -1.488074 -0.073450
5  0.446802  0.952855  1.540730
6  0.523746 -0.428814 -0.906692
7 -0.876370  0.155917 -1.035470

We can think of the Pandas objects (Index, Series, DataFrame) as containers for arrays, which hold the actual data and do the actual computation. To get the actual data inside an Index or Series, use the attribute .array.

In [40]:
df['a'].array

<NumpyExtensionArray>
[ -1.2902409328556301, -0.35417757860243076,   0.7311074657465024,
   0.1621426690023051,   -0.767878334524598,   0.4468021421608375,
   0.5237464809166776,  -0.8763695008997632]
Length: 8, dtype: float64

The full list of the attributes that are available for each data type can be found in the documentation: - Series - DataFrames

## Counting values in Series

The value_counts() Series method and top-level function computes a histogram of a 1D array of values.

In [41]:
data = np.random.randint(0, 7, size=50)

In [42]:
data

array([0, 3, 4, 4, 4, 1, 2, 1, 6, 2, 1, 6, 1, 6, 0, 3, 2, 5, 6, 6, 3, 6,
       3, 4, 2, 4, 1, 4, 5, 6, 2, 5, 0, 3, 1, 3, 2, 2, 6, 0, 3, 3, 3, 0,
       2, 6, 6, 0, 0, 0])

In [43]:
s = pd.Series(data)

In [44]:
s.value_counts()

6    10
3     9
0     8
2     8
4     6
1     6
5     3
Name: count, dtype: int64

Similarly, we can get the most frequently occurring value(s) (mode()) of the values in a Series or DataFrame.

In [45]:
s5 = pd.Series([1, 1, 3, 3, 3, 5, 5, 7, 7, 7])

In [46]:
s5.mode()

0    3
1    7
dtype: int64

In [47]:
df5 = df5 = pd.DataFrame({"A": np.random.randint(0, 7, size=50), 
                          "B": np.random.randint(-10, 15, size=50)})

In [48]:
df5.mode()

     A   B
0  5.0  -8
1  NaN  -7
2  NaN   1
3  NaN  11

 Warning

Even though mode() can be called on both Series and DataFrame, value_counts() can only be used on 1D arrays, therefore, not on DataFrames.

## .dt and .str accessors
### .dt accessor

Series has an accessor to succinctly return datetime-like properties for the values of the Series, if it is a datetime/period-like Series. This will return a Series, indexed like an existing Series.

In [49]:
s = pd.Series(pd.date_range('20130101 09:10:12', periods=4))

In [50]:
s

0   2013-01-01 09:10:12
1   2013-01-02 09:10:12
2   2013-01-03 09:10:12
3   2013-01-04 09:10:12
dtype: datetime64[ns]

In [51]:
s.dt.hour

0    9
1    9
2    9
3    9
dtype: int32

In [52]:
s.dt.second

0    12
1    12
2    12
3    12
dtype: int32

In [53]:
s.dt.day

0    1
1    2
2    3
3    4
dtype: int32

In [54]:
s.dt.dayofweek

0    1
1    2
2    3
3    4
dtype: int32

We can easily produce timezone-aware transformations:

In [55]:
stz = s.dt.tz_localize('US/Eastern')

In [56]:
stz

0   2013-01-01 09:10:12-05:00
1   2013-01-02 09:10:12-05:00
2   2013-01-03 09:10:12-05:00
3   2013-01-04 09:10:12-05:00
dtype: datetime64[ns, US/Eastern]

In [57]:
stz.dt.tz

We can also chain these types of operations:

In [58]:
s.dt.tz_localize('UTC').dt.tz_convert('US/Eastern')

0   2013-01-01 04:10:12-05:00
1   2013-01-02 04:10:12-05:00
2   2013-01-03 04:10:12-05:00
3   2013-01-04 04:10:12-05:00
dtype: datetime64[ns, US/Eastern]

### .str accessor

Series is equipped with a set of string processing methods that make it easy to operate on each element of the array. These are accessed via the Seriesâ€™s str attribute and generally have names matching the equivalent (scalar) built-in string methods.

In [59]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'],
              dtype="string")

In [60]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5    <NA>
6    caba
7     dog
8     cat
dtype: string

Using .str accessor, we can apply all string functions from standard Python to our Series.

## Sorting

There are three types of sorting in Pandas: 1. Sorting by index labels 2. Sorting by column values 3. Sorting by a combination of both

### By index

The Series.sort_index() and DataFrame.sort_index() methods are used to sort a Pandas object by its index levels.

In [61]:
df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [62]:
unsorted_df = df.reindex(index=['a', 'd', 'c', 'b'],
                          columns=['three', 'two', 'one'])

In [63]:
unsorted_df

      three       two       one
a       NaN -1.442515 -0.307528
d  1.120612  0.330110       NaN
c  0.066446 -0.108350  0.042218
b  0.178749 -0.625229 -0.277244

In [64]:
unsorted_df.sort_index()#sort by index

      three       two       one
a       NaN -1.442515 -0.307528
b  0.178749 -0.625229 -0.277244
c  0.066446 -0.108350  0.042218
d  1.120612  0.330110       NaN

In [65]:
unsorted_df.sort_index(ascending=False)#sort by index

      three       two       one
d  1.120612  0.330110       NaN
c  0.066446 -0.108350  0.042218
b  0.178749 -0.625229 -0.277244
a       NaN -1.442515 -0.307528

In [66]:
unsorted_df.sort_index(axis=1)#sort by column

        one     three       two
a -0.307528       NaN -1.442515
d       NaN  1.120612  0.330110
c  0.042218  0.066446 -0.108350
b -0.277244  0.178749 -0.625229

In [67]:
unsorted_df['three'].sort_index()#sort by index

a         NaN
b    0.178749
c    0.066446
d    1.120612
Name: three, dtype: float64

### By values

The Series.sort_values() method is used to sort a Series by its values. The DataFrame.sort_values() method is used to sort a DataFrame by its column or row values.

In [68]:
df1 = pd.DataFrame({'one': [2, 1, 1, 1],
                        'two': [1, 3, 2, 4],
                        'three': [5, 4, 3, 2]})

In [70]:
df1.sort_values(by='two') #sort by columns 'two'

   one  two  three
0    2    1      5
2    1    2      3
1    1    3      4
3    1    4      2

In [71]:
df1[['one', 'two', 'three']].sort_values(by=['one', 'two'])#sort by columns 'one' and 'two'

   one  two  three
2    1    2      3
1    1    3      4
3    1    4      2
0    2    1      5

These methods have a special treatment of NA values via the na_position argument:

In [72]:
s[2] = np.nan

In [73]:
s.sort_values()

0       A
3    Aaba
1       B
4    Baca
6    CABA
8     cat
7     dog
2    <NA>
5    <NA>
dtype: string

In [74]:
s.sort_values(na_position='first')

2    <NA>
5    <NA>
0       A
3    Aaba
1       B
4    Baca
6    CABA
8     cat
7     dog
dtype: string

by parameter in sort_values() method can refer to either columns or index level names.

We can use the name of the index to sort by both an index and a column.

In [75]:
idx = pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('a', 2),
                                   ('b', 2), ('b', 1), ('b', 1)])

In [76]:
idx.names = ['first','second']

In [77]:
df_multi = pd.DataFrame({'A': np.arange(6, 0, -1)},
                            index=idx)

In [78]:
df_multi

              A
first second
a     1       6
      2       5
      2       4
b     2       3
      1       2
      1       1

In [80]:
df_multi.sort_values(by=['second', 'A'])# Sort DataFrame by 'second' (index) and 'A' (column)

              A
first second
b     1       1
      1       2
a     1       6
b     2       3
a     2       4
      2       5